# MEPNetworkSegmentData Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPNetworkSegmentData Constructor
MEPNetworkSegmentData Class See Also
---
Creates a default segment data object.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public MEPNetworkSegmentData()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
MEPNetworkSegmentData()
```

# See Also
MEPNetworkSegmentData Class
MEPNetworkSegmentData Overload
Autodesk.Revit.DB.Analysis Namespace